## Plan Result (sbox_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 4 to change, 5 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;labs-hub-ngfw-poc&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["labs-hub-ngfw-poc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "2024-02-16T16:21:25.3800326+00:00" -> (known after apply)
      ~ host_name                = "labs-hub-ngfw.sandbox.platform.hmcts.net" -> "labs-hub-ngfw-poc.sandbox.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-hub-ngfw-poc" -> (known after apply)
        name                     = "labs-hub-ngfw-poc"
      ~ validation_token         = "wdk3vjwvgsl95qs9nsvhr0cxcww383y6" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/secrets/0--371f5952-29b7-425d-8f94-68c9ab55f38f-labs-hub-ngfw-sandbox-platform-hmcts-net" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["labs-hub-ngfw-poc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-hub-ngfw-poc" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/associations/labs-hub-ngfw-poc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["labs-hub-ngfw-poc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-hub-ngfw-poc" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/associations/labs-hub-ngfw-poc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["labs-hub-ngfw-poc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/labs-hub-ngfw-poc/origins/labs-hub-ngfw-poc"
        name                           = "labs-hub-ngfw-poc"
      ~ origin_host_header             = "labs-hub-ngfw.sandbox.platform.hmcts.net" -> "labs-hub-ngfw-poc.sandbox.platform.hmcts.net"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["labs-hub-ngfw-poc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-hub-ngfw-poc",
        ] -> (known after apply)
        id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/labs-hub-ngfw-poc"
        name                            = "labs-hub-ngfw-poc"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["labs-hub-ngfw-poc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-hub-ngfw-poc",
        ] -> (known after apply)
        id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/labs-hub-ngfw-pocHttpsRedirect"
        name                            = "labs-hub-ngfw-pocHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["labs-hub-ngfw-poc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/securityPolicies/labshubngfwpocsboxPremium-securityPolicy" -> (known after apply)
        name                     = "labshubngfwpocsboxPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-hub-ngfw-poc" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["labs-hub-ngfw-poc"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.labs-hub-ngfw.sandbox.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-hub-ngfw" -> (known after apply)
      ~ name                = "_dnsauth.labs-hub-ngfw" -> "_dnsauth.labs-hub-ngfw-poc" # forces replacement
      - tags                = {} -> null
        # (3 unchanged attributes hidden)

      - record {
          - value = "wdk3vjwvgsl95qs9nsvhr0cxcww383y6" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 4 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1984,"Program":"tfcmt","SHA1":"","Target":"sbox_global","Vars":{}} -->